import numpy as np
import matplotlib.pyplot as plt

a =[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159,160]
y1 = np.random.randint(3000,5000,[1,160])
y1 = np.ravel(y1)

y2 = np.random.randint(3000,5000,[1,160])
y2 = np.ravel(y2)
# print(a)
# 开始画图
# sub_axix = filter(lambda x:x%200 == 0, x)
plt.title('能见度对比图', fontsize=9)
plt.plot(a, y1, color='blue', label='label')
plt.plot(a, y2, color='orange', label='output')
plt.legend()  # 显示图例


miny = -0.94135359  # 下限载荷
maxy = 0.8470985  # 上限载荷

# plt.axis([0, 5, 0, 60])  # 最大坐标视窗
# plt.axhline(miny,color="Red")    # 画参考线方法一
# plt.axhline(maxy,color="Red")    # 画参考线方法一

# plt.rcParams['font.sans-serif']=['SimHei'] #用来正常显示中文标签

plt.axis([0, 160, 0, 8000])  # 设置范围，四个数分别对应x的起点终点和y的起点终点
plt.xlabel('对应图像', fontsize=9)
plt.ylabel('能见度', fontsize=9)
# plt.show()
plt.savefig("第二问.jpg",dpi=500,bbox_inches = 'tight')#解决图片不清晰，不完整的问题

